175. Напишите программу, которая выводит имя, фамилию, город и штат каждого человека из таблицы Person . Если адрес personId отсутствует в таблице Address, выведите null вместо него.

In [1]:
import pandas as pd
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [5]:
person.head()

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [6]:
address.head()

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [20]:
result = pd.merge(person,address, on = 'personId', how='left')\
    [['firstName', 'lastName', 'city', 'state']]

181. Напишите решение, как найти сотрудников, которые зарабатывают больше, чем их руководители.

In [21]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [22]:
employee.head()

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [26]:
pd.merge(employee,employee, left_on='managerId', right_on='id', how='left', suffixes=('_left', '_right'))\
    .query('salary_right<salary_left')\
    .rename(columns={'name_left':'Employee'})\
    [['Employee']]

  Employee
0      Joe